package org.example;

import org.example.subtasks.*;

public class App
{
    public static void main( String[] args )
    {
        Subtask1.run();

        Subtask2.run();

        Subtask4.run();

        Subtask5.run();

        Subtask7.run();

        Subtask13.run();
    }

    /*
        3. Создать список из элементов каталога и его подкаталогов.
        6. Задать два стека, поменять информацию местами.
        8. С использованием множества выполнить попарное суммирование произвольного
        конечного ряда чисел по следующим правилам: на первом этапе суммируются попарно рядом
        стоящие числа,на втором этапе суммируются результаты первого этапа и т. д. до тех пор,
        пока не останется одночисло.
        9. Сложить два многочлена заданной степени, если коэффициенты многочленов хранятся в
        объекте HashMap.
        10. Перемножить два многочлена заданной степени, если коэффициенты многочленов хранятся в
        различных списках.
        11. Не используя вспомогательных объектов, переставить отрицательные элементы данного
        списка в конец, а положительные — в начало списка.
     */
}
